<?php

use app\widgets\topmenu\TopMenu;
use app\widgets\profileblock\ProfileBlock;

/** @var $this \yii\web\View */

?>
<div class="title-h2">Помощь</div>

<div class="lk-accordeon">


<!-- // -->
    <div class="element active">
        <div class="title">
            1. Что я получаю в итоге, когда куплю шаблон на вашем сайте?
        </div>
        <div class="element-content">
<p>Вы получаете архив со всеми файлами шаблона и необходимые бесплатные модули (если это предусмотрено системой управления сайтом и шаблоном).</p>
        </div>
    </div>
<!-- // -->

<!-- // -->
    <div class="element">
        <div class="title">
            2. Каковы правила использования шаблона при покупке?
        </div>
        <div class="element-content">
<p>Вы можете создать один личный сайт после приобретения шаблона. Вы не можете перепродавать шаблон, либо претендавать на интеллектуальные и исключительные права в независимости от внесенных Вами правок в любой компонент шаблона. При создании второго сайта на данном шаблоне/сборке сайта Вам необходимо приобрести шаблон/сборку сайта еще раз.
Подробнее о Лицензионном соглашении конечного пользователя «Заказчика», читайте в разделе <a href="/page/agreement"><u>Пользовательское соглашение</u></a>.</p>
        </div>
    </div>
<!-- // -->

<!-- // -->
    <div class="element">
        <div class="title">
            3. Продажа права на использование предполагает возврат шаблона в случае, если он мне не подошел?
        </div>
        <div class="element-content">
<p>Нет, на продукты нематериальных ценностей возвраты не распространяются после того как шаблон уже был отправлен покупателю. Подробнее читайте в разделе <a href="/page/conditions"><u>Правила  возврата</u></a>.</p>
        </div>
    </div>
<!-- // -->

<!-- // -->
    <div class="element">
        <div class="title">
            4. Каким образом я получу свой шаблон?
        </div>
        <div class="element-content">
<p>После покупки ссылка на архив с купленным товаром будет доступна в вашем личном кабинете.</p>
        </div>
    </div>
<!-- // -->

<!-- // -->
    <div class="element">
        <div class="title">
            5. Заказал шаблон, но так и не получил его. Что делать? 
        </div>
        <div class="element-content">
<p>Пожалуйста, свяжитесь срочно с нами, мы решим возникшую проблему. Напишите нам по адресу: <a href="mailto:support@ultron.pro">support@ultron.pro</a> либо в онлайн-консультант сайта.</p>
        </div>
    </div>
<!-- // -->

<!-- // -->
    <div class="element">
        <div class="title">
            6. Я могу изменять код в шаблонах и менять тексты и изображения? 
        </div>
        <div class="element-content">
<p>Да, конечно, Вы можете вносить любые необходимые Вам правки во все элементы.</p>
        </div>
    </div>
<!-- // -->


    <div class="element">
        <div class="title">
            7. Установка сайта на хостинг Покупателя.
        </div>
        <div class="element-content">
<p>Мы можем установить  любой наш товар (HTML-шаблон или готовую сборку сайта) на хостинг Покупателя. Для этого свяжитесь с нами по электронной почте <a href="mailto:support@ultron.pro">support@ultron.pro</a>, указав:
<br>
- Номер заказа услуги (в личном кабинете, раздел МОИ ПОКУПКИ)
<br>
- Логин, пароль, имя сервера для доступа по FTP или SSH от вашего хостера
<br>
- Доступ к phpMyAdmin
<br>
- Данные для доступа к базам данных MySQL
<br>
- Название домена (должен быть куплен и привязан к вашему хостингу)
</p>
<p>Хостинг должен соответствовать обязательным требованиям системы, на которой сделан купленный сайт (сборки MODX, WordPress и т.п.) и быть оплаченным.</p>
<p>По окончанию работ, Покупателю передаются на почту, которая указана в настройках аккаунта, доступы к ПУ сайтом (если таковые имеются).</p>
<p>В целях безопасности, после установки нами сайта, настоятельно рекомендуем изменить все пароли, которые были ранее предоставлены.</p>
<p>Услуга платная и приобретается с покупкой товара, как «дополнительная услуга».</p>
        </div>
    </div>



    <div class="element">
        <div class="title">
            8. Покупка рекомендуемого хостинга и домена (при необходимости) и установка на него сборки MODX.
        </div>
        <div class="element-content">

<p>Если Вы еще не купили хостинг для своего сайта или сомневаетесь в выборе – доверьте это нам! Мы подберем для вас оптимальную конфигурацию хостинга, купим его и установим на нем Ваш сайт.</p>
<p><em>
- Почему эта услуга дешевле , чем установка на хостинг Заказчика ?
<br>
- Потому, что рекомендуемый нами хостинг проверен годами, гарантированно идеально соответствует техническим требованиям сайта и мы уверены в безпроблемной и быстрой установке.
</em></p>
<p>Услуги хостинга оплачиваются Покупателем дополнительно, это примерно 2500 рублей в год. Оплатив годовой период, Вы получаете <strong>доменное имя в подарок!</strong></p>
<p>Хостинг и домен приобретаются исключительно на данные Покупателя, который становится единственным и полноправным владельцем. Мы не требуем от Вас персональные данные для регистрации, а поможем самостоятельно пройти регистрацию, это займет не больше 5 минут!</p> 
<p>Для того, чтоб мы помогли купить Вам надежный хостинг, свяжитесь с нами по электронной почте <a href="mailto:support@ultron.pro">support@ultron.pro</a>, указав:
<br>
Номер заказа услуги (в личном кабинете, раздел МОИ ПОКУПКИ)
<br>
Название домена, который хотите купить (проверить свободен ли домен, можно по ссылке: <a href="https://timeweb.com/ru/services/domains/" target="_blank">https://timeweb.com/ru/services/domains/</a>.
</p>

<p>По окончанию работ, Покупателю передаются на почту, которая указана в настройках аккаунта, доступы к ПУ сайтом (если таковые имеются).</p>
<p>В целях безопасности, после установки нами сайта, настоятельно рекомендуем изменить все пароли, которые были ранее предоставлены.</p>
<p>Услуга платная и приобретается с покупкой товара, как «дополнительная услуга».</p>
        </div>
    </div>



	
	
    <div class="element">
        <div class="title">
            9. Технические требования к хостингу для установки MODX Revolution.
        </div>
        <div class="element-content">
        <p>Подобрать хостинг для MODX Revolution в общих чертах означает просто подобрать хостинг, недорогой, беспроблемный, с хорошей технической поддержкой. Особых пожеланий эта CMS не выдвигает: PHP, MySQL, …, вот в принципе и все. Стандартная система управления контентом со стандартными требованиями, которым соответствуют все серьезные хостинг-провайдеры.</p>
<p>Некоторые провайдеры создают специальные условия для нашей любимой платформы и рекламируют себя в качестве специализированных MODX - площадок. Другие – позволяют произвести установку CMS в одно нажатие кнопки. Но базовая схема – зарегистрировал доменное имя, оплатил хостинг, развернул MODX штатными средствами системы управления – работает везде.</p>
<hr>
<h3>Системные требования MODX Revolution</h3>
<strong>Операционная система</strong>
<p><em>Linux x86, Linux x86-64, Windows Server 2008</em></p>

<strong>Веб-сервер</strong>
<p><em>Apache 2.2.x, nginx 1.2.x, IIS 7.0</em></p>

<strong>Базы данных</strong>
<p><em>MySQL 4.1.20 и выше.</em> 
<br>
Разработчики предупреждают о том, что не стоит использовать версию MySQL 5.0.51, поскольку она содержит определенные системные ошибки, способные вызвать затруднения в стандартных запросах MODX.
<br><br>
Должны быть разрешены команды:
<br>
<em>SELECT, INSERT, UPDATE, DELETE, CREATE, ALTER, INDEX, DROP.
<br>
Дополнительно должен поддерживаться механизм хранения под названием MyISAM.
</em></p>

<strong>PHP и его модули</strong>
<p><em>PHP версии 5.1.1 и выше (исключение 5.1.6/5.2.0), запуск с FastCGI.</em>
<br><br>
Должны быть установлены:
<br>
<em>zlib, mod_rewrite, FastCGI, JSON, cURL, Imagemagick, GD lib, PDO с драйвером баз данных, SimpleXML.</em>
<br><br>
Настройки php.ini должны быть следующими:
<em>safe_mode off, register_globals off, magic_quotes_gpc off, php-mbstring on.
<br>
Плюс memory_limit от 24 МБ (рекомендуется не менее 64 МБ).
</em></p>
<p>Актуальные системные требования всегда можно уточнить на официальном сайте <a href="http://develop.modx.com/develop/revolution/requirements/" target="_new">http://develop.modx.com/develop/revolution/requirements/</a></p>
<hr>
<h3>Рекомендации от ULTRON</h3>
<p>Из практики работы с различными хостингами, на сегодняшний день, мы отдаем предпочтения следующим компаниям:
<br>
TimeWeb.ru
<br>
SpaceWeb.ru
<br>
Beget
<br>
MODHost – хостинг исключительно для MODX Revolution, быстрый, безопасный, с интегрированным в него магазином дополнений, в котором присутствуют самые необходимые платные и бесплатные модули.
<br>
MODX Cloud - дорогой, но быстрый хостинг от разработчиков CMS MODX. 
</P>
<strong>Выбирайте осознанно.</strong>
<p>Решая вопрос с выбором провайдера, определитесь со стоящими перед вами задачами. Какова будет ориентировочная посещаемость сайта, какое количество сайтов и баз данных вам может понадобиться, необходимо ли регистрировать доменное имя (многие провайдеры при определенных условиях предоставляется домен в подарок к выбранному тарифу) и т. д.</p>
<p>При реализации коммерческих проектов стоит рассматривать исключительно платный хостинг. Многие поставщики услуг по размещению сайтов в Интернете предлагают бесплатные тестовые периоды длительностью вплоть до месяца, чего обычно хватает для оценки качества работы как самих серверов, так и технического персонала.</p>
<p>Дополнительно изучите обзоры и отзывы о разных хостинговых компаниях других клиентов, в частности обратить внимание на то, какой у них показатель аптайма сайтов – очень желательно, чтобы он был 99.9%, так как неработающий сайт быстро теряет позиции в поисковых системах. И не забывайте про наличие грамотных специалистов в службе технической поддержки.</p>


        </div>
    </div>
	

    <div class="element">
        <div class="title">
            10. Услуги по доработке шаблонов
        </div>
        <div class="element-content">
<p>Часто случается, что есть необходимость доработать шаблон под свои нужды. Мы предлагаем Вам свои услуги для индивидуальных задач:</p>
<p>
1.	Корректировки стилей: смена шрифтов, цветовой схемы, изменение размеров блоков и т.д.;
<br>
2.	Корректировки скриптов: изменения параметров слайдера и прочих элементов пользовательского интерфейса;
<br>
3.	Добавление новых блоков: верстка, стили, скрипты.
</p>
<p><strong>Реализация услуги</strong>
<br>
Вся работа будет проходит в несколько этапов:
</p>
<p>
1.	Вы отправляете нам на почту <a href="mailto:update@ultron.pro">update@ultron.pro</a> заявку. В ней четко, желательно со скриншотами, описываете суть технического задания.
<br>
2.	Наша поддержка оценивает сложность задачи и подыскивает подходящего веб-мастера из наших партнеров.
<br>
3.	Веб-мастер объявляет стоимость и сроки своих работ, которые мы передаем Вам. Отметим, что все общение происходит исключительно через нас.
<br>
4.	Если Вас все устраивает - Вы оплачиваете заказ, предоставляете данные для входа на Ваш хостинг и веб-мастер приступает к работе.
<br>
5.	По завершению работ наша поддержка связывается с Вами для проверки задания.
</p>
<p>Цена и сроки услуги будут зависеть от сложности технического задания. Сложность задания определяется нашими операторами.</p>
<p>При рассмотрении заявки, техническая поддержка вправе отказаться от задачи, если реализатор (веб-мастер) не будет найден.</p>
<p>Мы гарантируем полную конфиденциальность предоставляемых нам данных.</p>
<p><strong>Общие рекомендации для закзчиков</strong>
<br>
Чем точнее Вы опишите свою задумку, тем корректнее и быстрее она будет реализована.
</p>
1.	Если речь идет о каком-либо блоке в шаблоне, обязательно приложите скриншот с графическим уточнением (стрелки, обводки красного цвета и т.д.).
<br>
2.	Если требуется добавление нового блока, крайне желательно приложить PSD или CDR файлы, где по-слойно разбиты все элементы.
</p>

        </div>
    </div>

	
	
	
	
</div>
